tap "fluxcd/tap"
tap "hashicorp/tap"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Next-generation plugin manager for zsh
brew "zplug"
# Flux CLI
brew "fluxcd/tap/flux"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "stats"
brew "gemini-cli"
